app/views/static_pages/statics.html.erb

        <tbody>
        <% @free_rooms = Room.free.all %>
---
SELECT "rooms".* FROM "rooms" WHERE (id NOT IN (1,2,1,12,1,9,9))