app/views/rooms/_form.html.erb

SELECT "goodies".* FROM "goodies"
---
  <%= hidden_field_tag "room[good_ids][]", nil %>
  <%= form.collection_check_boxes :good_ids, Good.all, :id, :name %>

SELECT "buildings".* FROM "buildings"
---
    <%= form.label :building %>
    <%= form.collection_select(:building_id, Building.all , :id, :name) %>