app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.where(user: current_user)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 1]]

  def show
        @bookings = Booking.all
---
SELECT  "bookings".* FROM "bookings" ORDER BY "bookings"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @booking = Booking.new(booking_params)
    @booking.room = @room
    @booking.user = current_user


    if @booking.save
      redirect_to bookings_path, success: "You have a successfully booked #{@room.name}"
    else
      flash[:alert] = "#{@booking.errors.first.last}"
---
INSERT INTO "bookings" ("valid_to", "valid_from", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["valid_to", "2019-07-13 00:00:00"], ["valid_from", "2019-07-12 00:00:00"], ["created_at", "2019-07-12 17:53:38.896399"], ["updated_at", "2019-07-12 17:53:38.896399"]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."room_id" = ?  [["room_id", 9]]

  def destroy
    @booking = Booking.find(params[:id])
    @booking.destroy
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 1]]

  def set_room
    @room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]