app/controllers/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT "buildings".* FROM "buildings"