app/controllers/goods_controller.rb

  def index
    @goods = Good.all
---
SELECT "goods".* FROM "goods"

  def create
    @good = Good.new(good_params)
    respond_to do |format|
      if @good.save
---
INSERT INTO "goods" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sillas"], ["created_at", "2019-07-11 14:08:59.234336"], ["updated_at", "2019-07-11 14:08:59.234336"]]

  def set_good
    @good = Good.find(params[:id])
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]