app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

  def new
    @room = Room.new
    @goods = Good.all
---
SELECT "goodies".* FROM "goodies"

  def edit
    @goods = Good.all
---
SELECT "goods".* FROM "goods"

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("name", "code", "floor", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sala verde"], ["code", "a303"], ["floor", "2"], ["capacity", 100], ["created_at", "2019-07-22 00:50:54.582030"], ["updated_at", "2019-07-22 00:50:54.582030"]]

  def update
    respond_to do |format|
      if @room.update(room_params)
---
UPDATE "rooms" SET "code" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["code", "A103"], ["updated_at", "2019-07-25 19:49:55.802456"], ["id", 2]]

  def set_room
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]