app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email].downcase) # busca como identificador del user el mail, lo guarda en una variable, y lo autentica con el password
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "laura.ramos@ibm.com"], ["LIMIT", 1]]