app/controllers/static_pages_controller.rb

def statics

    @topfiveusers = User.includes(:bookings)
    .group("bookings.user_id")
    .pluck("users.name, count(bookings.id)")
    .first(5).last(30.days)

    @topfiverooms = Room.includes(:bookings)
    .group("bookings.room_id")
    .pluck("rooms.name, count(bookings.id)")
    .first(5).last(30.days)
---
SELECT users.name, count(bookings.id) FROM "users" LEFT OUTER JOIN "bookings" ON "bookings"."user_id" = "users"."id" GROUP BY bookings.user_id
SELECT "bookings"."room_id" FROM "bookings" WHERE (valid_from <= '2019-07-27 16:29:51.657171' AND valid_to >= '2019-07-27 16:29:51.657171')
SELECT rooms.name, count(bookings.id) FROM "rooms" LEFT OUTER JOIN "bookings" ON "bookings"."room_id" = "rooms"."id" GROUP BY bookings.room_id