app/controllers/users_controller.rb

INSERT INTO "users" ("name", "birthdate", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.new(user_params)
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "is_admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_admin", 1], ["updated_at", "2019-07-29 14:40:27.415051"], ["id", 2]]
---
    def update

    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)