app/models/room.rb

 def self.free(time = Time.now)
    booking_room_ids = Booking.time_lapse(time).pluck(:room_id)
---
SELECT "bookings"."room_id" FROM "bookings" WHERE (valid_from <= '2019-07-29 13:28:19.078389' AND valid_to >= '2019-07-29 13:28:19.078389')

  def self.booked(time = Time.now)
    booking_room_ids = Booking.time_lapse(time).pluck(:room_id)
---
SELECT "bookings"."room_id" FROM "bookings" WHERE (valid_from <= '2019-07-29 13:28:19.045855' AND valid_to >= '2019-07-29 13:28:19.045855')